---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId
source: html/cb14904b-7147-4742-09c9-98da77011030.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId

Represents a unique identifier for one analytical segment in the network.

## Syntax (C#)
```csharp
public class MEPNetworkSegmentId : IDisposable
```